In [1]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### For these exercises you have to use the students table that was created in the notebooks 02, 04 and 06

In [2]:
%%sql 
SELECT * FROM students;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(1, 'Alice', 20, 'Computer Science'),
 (2, 'Bob', 22, 'Economics'),
 (3, 'Charlie', 19, 'Chemistry'),
 (4, 'Diana', 21, 'Computer Science'),
 (5, 'Eve', 18, None),
 (6, 'Mark', 25, 'History')]

In [3]:
%%sql
SELECT * FROM alumni;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(7, 'Grace', 2019, 'Arts'),
 (8, 'Hannah', 2021, 'History'),
 (9, 'Ian', 2020, 'Biology'),
 (10, 'Diana', 2023, 'Biology'),
 (11, 'Alice', 2022, 'Civil Engineering'),
 (12, 'Frank', 2020, 'Social Work')]

In [4]:
%%sql
SELECT * FROM mentorship;

 * postgresql://user:***@localhost:5432/postgres
7 rows affected.

[('Alice', 'Bob', 'Economics'),
 ('Bob', 'Charlie', 'Chemistry'),
 ('Hannah', 'Diana', 'Computer Science'),
 ('Grace', 'Mark', 'History'),
 ('Alice', 'Grace', 'Arts'),
 ('Frank', 'Ian', 'Biology'),
 ('Eve', 'Frank', 'Social Work')]

### 1. List all students with their age and show their rank (1 = youngest). Use a ranking function.

### 2. List alumni with their graduation year and assign a dense rank (1 = earliest year).

### 3. List students and rank them by age within each major.

### 4. Assign a rank, a dense rank and a sequential row number to all alumni ordered by graduation year. Tell the difference

1. Rank() assigns a rank to each row, if there are some with same value, it labels them with the same value and skips the correspondent same amount of number until next label.
2. Dense_rank() assigns a rank to each row without gaps in ranking values.
3. Row_number() assigns a unique row number to each row.

### 5. Show all students ordered by age and calculate a running total of their ages.

### 6. Show each studentâ€™s age together with the average age of the previous and next student (a 3-row moving average). The calculate the avg number of that column.

### 7. List all students with their percentile rank based on age.

### 8. Create a table with students and alumni names, majors and ages (alumni age is current age - 2000). For each major, show the first and last student name ordered by age. 

Hint: Use PARTITION BY major with FIRST_VALUE and LAST_VALUE.

### 9.Continue using the table formed by students + alumni. For each major, show the 2nd youngest student.

### 10. For each student, show their name, major, and the total number of students in the same major (without grouping).